# pandas数据分析
### 数据分析流程
1. 数据收集
2. 数据清洗
    - 缺失值
    - 错误数据
    - 格式混乱
3. 数据分析
    - 统计(平均值，最大值，比例等等)
    - 分组对比
4. 数据可视化
    - 折线图看趋势
    - 柱状图对比
    - 散点图看相关性
-----

### 1. 数据的导入

In [2]:
import pandas as pd
import numpy as np
from pyarrow.types import int64
from uri_template import expand

In [2]:
df = pd.read_csv('../data/employees.csv')
df

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,MK_REP,6000.0,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,HR_REP,6500.0,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,PR_REP,10000.0,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,AC_MGR,12000.0,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,AC_ACCOUNT,8300.0,NaN,205.0,110.0

### 1.2 JSON数据的导入
- 对于复杂格式的`JSON`文件不能直接使用read_json()函数，需要先使用`json`库进行处理,后转成DataFrame格式再进行操作

In [3]:
import json

with open('../data/test.json', 'r') as f:
    data = json.load(f)
print(data['users'])
print(type(data))
df = pd.DataFrame(data['users'])
print(type(df))
df

[{'id': 1, 'name': '张三', 'age': 28, 'email': 'zhangsan@example.com', 'is_active': True, 'join_date': '2022-03-15'}, {'id': 2, 'name': '李四', 'age': 35, 'email': 'lisi@example.com', 'is_active': False, 'join_date': '2021-11-02'}, {'id': 3, 'name': '王五', 'age': 24, 'email': 'wangwu@example.com', 'is_active': True, 'join_date': '2023-01-20'}]
<class 'dict'>
<class 'pandas.core.frame.DataFrame'>

   id name  age                 email  is_active   join_date
0   1   张三   28  zhangsan@example.com       True  2022-03-15
1   2   李四   35      lisi@example.com      False  2021-11-02
2   3   王五   24    wangwu@example.com       True  2023-01-20

### 2. 数据的导出

In [7]:
df = df.tail()
df.to_csv('../data/employees_new.csv')

### 3. 缺失值的处理

In [13]:
# 查看是否为缺失值Series格式
s = pd.Series([12, 25, np.nan, None, pd.NA])
print(s)

print('检测缺失值\n', s.isna())
print('检测缺失值\n', s.isnull())
print('查看缺失值个数\n', s.isna().sum())
print('剔除缺失值\n', s.dropna())

0      12
1      25
2     NaN
3    None
4    <NA>
dtype: object
检测缺失值
 0    False
1    False
2     True
3     True
4     True
dtype: bool
检测缺失值
 0    False
1    False
2     True
3     True
4     True
dtype: bool
查看缺失值个数
 3
剔除缺失值
 0    12
1    25
dtype: object

In [20]:
# 查看是否为缺失值DataFrame格式
df = pd.DataFrame([[1, pd.NA, 2], [2, 3, 5], [None, 4, 6]])
print(df)
# 检测缺失值
print('检测缺失值\n', df.isna())
print('检测缺失值\n', df.isnull())
print('查看缺失值个数,注意这个是按照列来看的\n', df.isna().sum())
# 删除缺失值
print('剔除缺失值,注意会把有缺失值的一整条记录都删掉\n', df.dropna())
print('如果所有的值都是缺失值才删除这一行\n', df.dropna(how='all'))
print('如果至少有n个值不是缺失值，就保留\n', df.dropna(thresh=3))
print('删除一整列\n', df.dropna(axis=1))
print('删除指定列的缺失值\n', df.dropna(subset=[1]))

     0     1  2
0  1.0  <NA>  2
1  2.0     3  5
2  NaN     4  6
检测缺失值
        0      1      2
0  False   True  False
1  False  False  False
2   True  False  False
检测缺失值
        0      1      2
0  False   True  False
1  False  False  False
2   True  False  False
查看缺失值个数,注意这个是按照列来看的
 0    1
1    1
2    0
dtype: int64
剔除缺失值,注意会把有缺失值的一整条记录都删掉
      0  1  2
1  2.0  3  5
如果所有的值都是缺失值才删除这一行
      0     1  2
0  1.0  <NA>  2
1  2.0     3  5
2  NaN     4  6
如果至少有n个值不是缺失值，就保留
      0  1  2
1  2.0  3  5
删除一整列
    2
0  2
1  5
2  6
删除指定列的缺失值
      0  1  2
1  2.0  3  5
2  NaN  4  6

In [27]:
# 填充缺失值
df = pd.read_csv('../data/weather_withna.csv')
df.tail()
df.isna().sum(axis=0)

print('使用字典来填充,这里使用固定值\n', df.fillna({'temp_max': 20}).tail())  # 只看最后几个数据
print('使用字典来填充,这里使用统计值例如平均值\n', df.fillna(df[['wind']].mean()).tail())
print('使用字典来填充,这里使用缺失值前面的相邻数值填充\n', df.ffill().tail())
print('使用字典来填充,这里使用缺失值后面的相邻数值填充\n', df.bfill().tail())

使用字典来填充,这里使用固定值
             date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            NaN      20.0       NaN   NaN     NaN
1457  2015-12-28            NaN      20.0       NaN   NaN     NaN
1458  2015-12-29            NaN      20.0       NaN   NaN     NaN
1459  2015-12-30            NaN      20.0       NaN   NaN     NaN
1460  2015-12-31           20.6      12.2       5.0   3.8    rain
使用字典来填充,这里使用统计值例如平均值
             date  precipitation  temp_max  temp_min      wind weather
1456  2015-12-27            NaN       NaN       NaN  3.242055     NaN
1457  2015-12-28            NaN       NaN       NaN  3.242055     NaN
1458  2015-12-29            NaN       NaN       NaN  3.242055     NaN
1459  2015-12-30            NaN       NaN       NaN  3.242055     NaN
1460  2015-12-31           20.6      12.2       5.0  3.800000    rain
使用字典来填充,这里使用缺失值前面的相邻数值填充
             date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            0.0      11.1       4.4   4.8     sun
1457  2015-12-28            0.0      11.1       4.4   4.8     sun
1458  2015-12-29            0.0      11.1       4.4   4.8     sun
1459  2015-12-30            0.0      11.1       4.4   4.8     sun
1460  2015-12-31           20.6      12.2       5.0   3.8    rain
使用字典来填充,这里使用缺失值后面的相邻数值填充
             date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27           20.6      12.2       5.0   3.8    rain
1457  2015-12-28           20.6      12.2       5.0   3.8    rain
1458  2015-12-29           20.6      12.2       5.0   3.8    rain
1459  2015-12-30           20.6      12.2       5.0   3.8    rain
1460  2015-12-31           20.6      12.2       5.0   3.8    rain

### 4. 删除重复值

In [5]:
data = {
    "name": ['alice', 'alice', 'bob', 'alice', 'jack', 'bob'],
    "age": [26, 25, 30, 25, 35, 30],
    "city": ['beijing', 'beijing', 'VA', 'beijing', 'Brisbane', 'VA']
}
df = pd.DataFrame(data)
df

    name  age      city
0  alice   26   beijing
1  alice   25   beijing
2    bob   30        VA
3  alice   25   beijing
4   jack   35  Brisbane
5    bob   30        VA

In [9]:
print('检查重复值\n', df.duplicated())
print('删除重复值，完全重复的数据\n', df.drop_duplicates())
# 根据指定的列去重
print('删除重复值，部分重复的数据\n', df.drop_duplicates(subset=['name']))
# 保留最新出现的行，删除重复的之前出现的行
print('删除重复值，部分重复的数据\n', df.drop_duplicates(subset=['name'], keep='last'))

检查重复值
 0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool
删除重复值，完全重复的数据
     name  age      city
0  alice   26   beijing
1  alice   25   beijing
2    bob   30        VA
4   jack   35  Brisbane
删除重复值，部分重复的数据
     name  age      city
0  alice   26   beijing
2    bob   30        VA
4   jack   35  Brisbane
删除重复值，部分重复的数据
     name  age      city
3  alice   25   beijing
4   jack   35  Brisbane
5    bob   30        VA

### 5. 数据类型转换

In [12]:
df = pd.read_csv('../data/sleep.csv')
df.dtypes

person_id                    int64
gender                      object
age                          int64
occupation                  object
sleep_duration             float64
sleep_quality              float64
physical_activity_level      int64
stress_level                 int64
bmi_category                object
blood_pressure              object
heart_rate                   int64
daily_steps                  int64
sleep_disorder              object
dtype: object

In [17]:
df['age'] = df['age'].astype('int16')
df['gender'] = df['gender'].astype('category')
df.gender
df.dtypes

person_id                     int64
gender                     category
age                           int16
occupation                   object
sleep_duration              float64
sleep_quality               float64
physical_activity_level       int64
stress_level                  int64
bmi_category                 object
blood_pressure               object
heart_rate                    int64
daily_steps                   int64
sleep_disorder               object
dtype: object

In [18]:
df['is_male'] = df['gender'].map({'Female': False, 'Male': True})
df.is_male

0       True
1      False
2       True
3       True
4       True
       ...
395    False
396    False
397    False
398    False
399     True
Name: is_male, Length: 400, dtype: category
Categories (2, bool): [False, True]

### 6. 数据变形

In [29]:
data = {
    'ID': [1, 2],
    'name': ['alice', 'bob'],
    'Math': [90, 85],
    'English': [88, 92],
    'Science': [95, 89]
}

df = pd.DataFrame(data)
df.T
df

'''
宽表转化成长表
1 alice math 90
2 alice English 88
3 alice science 95
'''
df2 = pd.melt(df, id_vars=['ID', 'name'], var_name='subject/科目', value_name='score/分数')
print('宽表变长表的结果\n', df2.sort_values('name'))

'''长表转化成宽表'''
df3 = df2.pivot(index=['ID', 'name'], columns='subject/科目', values='score/分数')
print('长表变宽表的结果\n', df3.sort_values('name'))

宽表变长表的结果
    ID   name subject/科目  score/分数
0   1  alice       Math        90
2   1  alice    English        88
4   1  alice    Science        95
1   2    bob       Math        85
3   2    bob    English        92
5   2    bob    Science        89
长表变宽表的结果
 subject/科目  English  Math  Science
ID name
1  alice         88    90       95
2  bob           92    85       89

In [31]:
data2 = {
    'ID': [1, 2],
    'name': ['alice Zhang', 'bob Wang'],
    'Math': [90, 85],
    'English': [88, 92],
    'Science': [95, 89]
}

df = pd.DataFrame(data2)
# 分列
df[['first_name', 'last_name']] = df['name'].str.split(" ", expand=True)
df

   ID         name  Math  English  Science first_name last_name
0   1  alice Zhang    90       88       95      alice     Zhang
1   2     bob Wang    85       92       89        bob      Wang

In [38]:
# 分列的具体操作案例，血压值分开低压和高压
df = pd.read_csv('../data/sleep.csv')
df = df[['person_id', 'blood_pressure']]
df[['systolic', 'diastolic']] = df['blood_pressure'].str.split('/', expand=True)
df['systolic'] = df['systolic'].astype('int64')
df['diastolic'] = df['diastolic'].astype('int64')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   person_id       400 non-null    int64
 1   blood_pressure  400 non-null    object
 2   systolic        400 non-null    int64
 3   diastolic       400 non-null    int64
dtypes: int64(3), object(1)
memory usage: 12.6+ KB

### 7. 数据分箱
```python
df.cut(df,bins=3,lable=)
df.rename()
df.set_index()
df.reset_index()
```
- 把一个个连续的数据分为不同的类别和范围
- 一般来说做数据分箱处理的时候先拿数据的前10条验证以下看看方法是否合理，之后再推广到全部数据上

In [39]:
df = pd.read_csv('../data/employees.csv')
df.head(10)

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
5,105,David,Austin,DAUSTIN,590.423.4569,IT_PROG,4800.0,NaN,103.0,60.0
6,106,Valli,Pataballa,VPATABAL,590.423.4560,IT_PROG,4800.0,NaN,103.0,60.0
7,107,Diana,Lorentz,DLORENTZ,590.423.5567,IT_PROG,4200.0,NaN,103.0,60.0
8,108,Nancy,Greenberg,NGREENBE,515.124.4569,FI_MGR,12000.0,NaN,101.0,100.0
9,109,Daniel,Faviet,DFAVIET,515.124.4169,FI_ACCOUNT,9000.0,NaN,108.0,100.0

In [41]:
df1 = df.head(10)[['employee_id', 'salary']]
df1

   employee_id   salary
0          100  24000.0
1          101  17000.0
2          102  17000.0
3          103   9000.0
4          104   6000.0
5          105   4800.0
6          106   4800.0
7          107   4200.0
8          108  12000.0
9          109   9000.0

In [52]:
pd.cut(df1['salary'], bins=2)  # bins等于整数，分成n段区间，起始值用的最小值，结束值是最大值
pd.cut(df1['salary'], bins=3).value_counts()
pd.cut(df1['salary'], bins=[0, 10000, 20000, 30000])  # bins传进去一个区间，分成3段0~10000，10000~20000，20000~30000
pd.cut(df1['salary'], bins=[0, 10000, 20000, 30000]).value_counts()
df1['收入范围'] = pd.cut(df1['salary'], bins=[0, 10000, 20000, 30000], labels=['低', '中', '高'])  # lables用于展示标签，展示更直观

pd.qcut(df1['salary'], q=3).value_counts()  # qcut是按照比例来分箱的，不是平均分配的，而是按照数据的分布来分箱的

salary
(12000.0, 24000.0]    4
(4199.999, 6000.0]    3
(6000.0, 12000.0]     3
Name: count, dtype: int64

In [57]:
# 数据分箱小练习,对睡眠质量进行分箱处理
df = pd.read_csv('../data/sleep.csv')
df1 = df.head(10)[['person_id', 'sleep_quality']]
df1
df['睡眠质量'] = pd.cut(df['sleep_quality'], bins=3, labels=['睡眠质量低', '睡眠质量中', '睡眠质量高'])
df['睡眠质量'].value_counts()

睡眠质量
睡眠质量中    206
睡眠质量高    129
睡眠质量低     65
Name: count, dtype: int64

In [64]:
df = pd.DataFrame({
    'name': ['jack', 'alice', 'tom', 'bob'],
    'age': [20, 30, 40, 50],
    'gender': ['female', 'male', 'female', 'male']
})
# 直接设置索引的名称,inplace参数是直接在数据上操作
df.set_index("name", inplace=True)
df.reset_index(inplace=True)
# 修改列名，直接修改index
df.rename(columns={'age': '年龄'}, index={0: 4})

    name  年龄  gender
4   jack  20  female
1  alice  30    male
2    tom  40  female
3    bob  50    male

### 8. 时间数据的处理

In [77]:
d = pd.Timestamp('2026-02-21 10:22')
print(d)
print(type(d))
print('年:', d.year,
      '月:', d.month,
      '季度:', d.quarter,
      '日:', d.day,
      '时:', d.hour,
      '分:', d.minute,
      '秒:', d.second)

print(
    '是否年末:', d.is_year_end,
    '是否年初:', d.is_year_start,
    '是否季度末:', d.is_quarter_end,
    '是否季度初:', d.is_quarter_start,
    '是否月末:', d.is_month_end,
    '是否月初:', d.is_month_start)

# 方法
print('星期几', d.day_name())
print('转换为天', d.to_period('D'))
print('转换为季度', d.to_period('Q'))
print('转换为年度', d.to_period('Y'))
print('转换为月度', d.to_period('M'))
print('转换为周维度', d.to_period('W'))

2026-02-21 10:22:00
<class 'pandas._libs.tslibs.timestamps.Timestamp'>
年: 2026 月: 2 季度: 1 日: 21 时: 10 分: 22 秒: 0
是否年末: False 是否年初: False 是否季度末: False 是否季度初: False 是否月末: False 是否月初: False
星期几 Saturday
转换为天 2026-02-21
转换为季度 2026Q1
转换为年度 2026
转换为月度 2026-02
转换为周维度 2026-02-16/2026-02-22

In [8]:
# 讲字符串转换为日期类型
a = pd.to_datetime('2026 02 28 21:17')
print(a.day_name())

Saturday

In [9]:
# DataFrame日期转换
df = pd.DataFrame({
    'sales': [100, 200, 300],
    'date': ['20260101', '20260201', '20260301']
})

df['datetime'] = pd.to_datetime(df['date'])
df

   sales      date   datetime
0    100  20260101 2026-01-01
1    200  20260201 2026-02-01
2    300  20260301 2026-03-01

In [14]:
# CSV 日期转换 CSV中日期是Objects对象(字符串)转化为时间格式
df = pd.read_csv('../data/weather.csv', parse_dates=['date'])
df['date'].dt.day_name()

0          Sunday
1          Monday
2         Tuesday
3       Wednesday
4        Thursday
          ...
1456       Sunday
1457       Monday
1458      Tuesday
1459    Wednesday
1460     Thursday
Name: date, Length: 1461, dtype: object

In [16]:
# 日期数据作为索引
df.set_index('date', inplace=True)

           date  precipitation  temp_max  temp_min  wind  weather
0    2012-01-01            0.0      12.8       5.0   4.7  drizzle
1    2012-01-02           10.9      10.6       2.8   4.5     rain
2    2012-01-03            0.8      11.7       7.2   2.3     rain
3    2012-01-04           20.3      12.2       5.6   4.7     rain
4    2012-01-05            1.3       8.9       2.8   6.1     rain
...         ...            ...       ...       ...   ...      ...
1456 2015-12-27            8.6       4.4       1.7   2.9     rain
1457 2015-12-28            1.5       5.0       1.7   1.3     rain
1458 2015-12-29            0.0       7.2       0.6   2.6      fog
1459 2015-12-30            0.0       5.6      -1.0   3.4      sun
1460 2015-12-31            0.0       5.6      -2.1   3.5      sun

[1461 rows x 6 columns]

In [17]:
# 时间间隔,注意是特殊的时间格式
d1 = pd.Timestamp('2023-01-15')
d2 = pd.Timestamp('2033-01-15')
d3 = d2 - d1
print(type(d3))
print(d3)

# 一般在数据集中这样使用
df['delta'] = df['date'] - df['date'][0]

<class 'pandas._libs.tslibs.timedeltas.Timedelta'>
3653 days 00:00:00

In [21]:
# 时间序列
days = pd.date_range("2026-02-28", "2027-03-15", freq="W")
days2 = pd.date_range("2026-02-28", periods=10, freq="YS")
print(days)
print(days2)

DatetimeIndex(['2026-03-01', '2026-03-08', '2026-03-15', '2026-03-22',
               '2026-03-29', '2026-04-05', '2026-04-12', '2026-04-19',
               '2026-04-26', '2026-05-03', '2026-05-10', '2026-05-17',
               '2026-05-24', '2026-05-31', '2026-06-07', '2026-06-14',
               '2026-06-21', '2026-06-28', '2026-07-05', '2026-07-12',
               '2026-07-19', '2026-07-26', '2026-08-02', '2026-08-09',
               '2026-08-16', '2026-08-23', '2026-08-30', '2026-09-06',
               '2026-09-13', '2026-09-20', '2026-09-27', '2026-10-04',
               '2026-10-11', '2026-10-18', '2026-10-25', '2026-11-01',
               '2026-11-08', '2026-11-15', '2026-11-22', '2026-11-29',
               '2026-12-06', '2026-12-13', '2026-12-20', '2026-12-27',
               '2027-01-03', '2027-01-10', '2027-01-17', '2027-01-24',
               '2027-01-31', '2027-02-07', '2027-02-14', '2027-02-21',
               '2027-02-28', '2027-03-07', '2027-03-14'],
              dtype='datetime64[ns]', freq='W-SUN')
DatetimeIndex(['2027-01-01', '2028-01-01', '2029-01-01', '2030-01-01',
               '2031-01-01', '2032-01-01', '2033-01-01', '2034-01-01',
               '2035-01-01', '2036-01-01'],
              dtype='datetime64[ns]', freq='YS-JAN')

### 9. 分组聚合
```python
    df.groupby('分组的字段‘)['聚合的字段'].聚合函数()
```

In [30]:
df = pd.read_csv('../data/employees.csv')
# 计算不同部门的平均薪资
# 先删除空值
df = df.dropna(subset=['department_id'])
# department_id是浮点型，为了方便聚合变成整型
df['department_id'] = df['department_id'].astype('int64')
# 分组聚合
df.groupby('department_id').groups  # groups查看分组
df.groupby('department_id').get_group(20)  # 查看具体某个组的分组数据
df.groupby('department_id')['salary'].mean().round(2)  # 加上round2是因为要去除多余小数点看的方便

department_id
10      4400.00
20      9500.00
30      4150.00
40      6500.00
50      3475.56
60      5760.00
70     10000.00
80      8955.88
90     19333.33
100     8600.00
110    10150.00
Name: salary, dtype: float64

In [31]:
# 计算不同部门不同岗位的人的平均薪资
df.groupby(['department_id', 'job_id'])['salary'].mean().round(2)

department_id  job_id
10             AD_ASST        4400.00
20             MK_MAN        13000.00
               MK_REP         6000.00
30             PU_CLERK       2780.00
               PU_MAN        11000.00
40             HR_REP         6500.00
50             SH_CLERK       3215.00
               ST_CLERK       2785.00
               ST_MAN         7280.00
60             IT_PROG        5760.00
70             PR_REP        10000.00
80             SA_MAN        12200.00
               SA_REP         8396.55
90             AD_PRES       24000.00
               AD_VP         17000.00
100            FI_ACCOUNT     7920.00
               FI_MGR        12000.00
110            AC_ACCOUNT     8300.00
               AC_MGR        12000.00
Name: salary, dtype: float64